Changing the network block does remove...
```
      ~ network {
            mtu     = 0
          ~ options = {
                "calico_cloud_provider"         = "none"
              - "calico_flex_volume_plugin_dir" = "/usr/libexec/kubernetes/kubelet-plugins/volume/exec/nodeagent~uds" -> null
            }
```
... from the list of changes that are always pending.  :+1: 

But I'm still left with with the same changes as koboltmarky originally reported... 
```
  ~ resource "rke_cluster" "cluster" {
      ~ cluster_cidr              = "10.42.0.0/16" -> (known after apply)
      ~ cluster_dns_server        = "10.43.0.10" -> (known after apply)
      ~ cluster_domain            = "cluster.local" -> (known after apply)
      ~ kube_config_yaml          = (sensitive value)
      ~ rke_cluster_yaml          = (sensitive value)
      ~ rke_state                 = (sensitive value)
```
... even after multiple applies.